rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K388_SAI.h
#define SAI_RCR1_RFW_MASK                        (0x7U)
#define SAI_RCR1_RFW_SHIFT                       (0U)
#define SAI_RCR1_RFW_WIDTH                       (3U)
#define SAI_RCR1_RFW(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR1_RFW_SHIFT)) & SAI_RCR1_RFW_MASK)
/*! @} */

/*! @name RCR2 - Receive Configuration 2 */
/*! @{ */

#define SAI_RCR2_DIV_MASK                        (0xFFU)
#define SAI_RCR2_DIV_SHIFT                       (0U)
#define SAI_RCR2_DIV_WIDTH                       (8U)
#define SAI_RCR2_DIV(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_DIV_SHIFT)) & SAI_RCR2_DIV_MASK)

#define SAI_RCR2_BYP_MASK                        (0x800000U)
#define SAI_RCR2_BYP_SHIFT                       (23U)
#define SAI_RCR2_BYP_WIDTH                       (1U)
#define SAI_RCR2_BYP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BYP_SHIFT)) & SAI_RCR2_BYP_MASK)

#define SAI_RCR2_BCD_MASK                        (0x1000000U)
#define SAI_RCR2_BCD_SHIFT                       (24U)
#define SAI_RCR2_BCD_WIDTH                       (1U)
#define SAI_RCR2_BCD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCD_SHIFT)) & SAI_RCR2_BCD_MASK)

#define SAI_RCR2_BCP_MASK                        (0x2000000U)
#define SAI_RCR2_BCP_SHIFT                       (25U)
#define SAI_RCR2_BCP_WIDTH                       (1U)
#define SAI_RCR2_BCP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCP_SHIFT)) & SAI_RCR2_BCP_MASK)

#define SAI_RCR2_MSEL_MASK                       (0xC000000U)
#define SAI_RCR2_MSEL_SHIFT                      (26U)
#define SAI_RCR2_MSEL_WIDTH                      (2U)
#define SAI_RCR2_MSEL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_MSEL_SHIFT)) & SAI_RCR2_MSEL_MASK)

#define SAI_RCR2_BCI_MASK                        (0x10000000U)
#define SAI_RCR2_BCI_SHIFT                       (28U)
#define SAI_RCR2_BCI_WIDTH                       (1U)
#define SAI_RCR2_BCI(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_BCI_SHIFT)) & SAI_RCR2_BCI_MASK)

#define SAI_RCR2_SYNC_MASK                       (0x40000000U)
#define SAI_RCR2_SYNC_SHIFT                      (30U)
#define SAI_RCR2_SYNC_WIDTH                      (1U)
#define SAI_RCR2_SYNC(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR2_SYNC_SHIFT)) & SAI_RCR2_SYNC_MASK)
/*! @} */

/*! @name RCR3 - Receive Configuration 3 */
/*! @{ */

#define SAI_RCR3_WDFL_MASK                       (0xFU)
#define SAI_RCR3_WDFL_SHIFT                      (0U)
#define SAI_RCR3_WDFL_WIDTH                      (4U)
#define SAI_RCR3_WDFL(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_WDFL_SHIFT)) & SAI_RCR3_WDFL_MASK)

#define SAI_RCR3_RCE_MASK                        (0xF0000U)  /* Merged from fields with different position or width, of widths (1, 4), largest definition used */
#define SAI_RCR3_RCE_SHIFT                       (16U)
#define SAI_RCR3_RCE_WIDTH                       (4U)
#define SAI_RCR3_RCE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_RCE_SHIFT)) & SAI_RCR3_RCE_MASK)  /* Merged from fields with different position or width, of widths (1, 4), largest definition used */

#define SAI_RCR3_CFR_MASK                        (0xF000000U)
#define SAI_RCR3_CFR_SHIFT                       (24U)
#define SAI_RCR3_CFR_WIDTH                       (4U)
#define SAI_RCR3_CFR(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR3_CFR_SHIFT)) & SAI_RCR3_CFR_MASK)
/*! @} */

/*! @name RCR4 - Receive Configuration 4 */
/*! @{ */

#define SAI_RCR4_FSD_MASK                        (0x1U)
#define SAI_RCR4_FSD_SHIFT                       (0U)
#define SAI_RCR4_FSD_WIDTH                       (1U)
#define SAI_RCR4_FSD(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSD_SHIFT)) & SAI_RCR4_FSD_MASK)

#define SAI_RCR4_FSP_MASK                        (0x2U)
#define SAI_RCR4_FSP_SHIFT                       (1U)
#define SAI_RCR4_FSP_WIDTH                       (1U)
#define SAI_RCR4_FSP(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSP_SHIFT)) & SAI_RCR4_FSP_MASK)

#define SAI_RCR4_ONDEM_MASK                      (0x4U)
#define SAI_RCR4_ONDEM_SHIFT                     (2U)
#define SAI_RCR4_ONDEM_WIDTH                     (1U)
#define SAI_RCR4_ONDEM(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_ONDEM_SHIFT)) & SAI_RCR4_ONDEM_MASK)

#define SAI_RCR4_FSE_MASK                        (0x8U)
#define SAI_RCR4_FSE_SHIFT                       (3U)
#define SAI_RCR4_FSE_WIDTH                       (1U)
#define SAI_RCR4_FSE(x)                          (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FSE_SHIFT)) & SAI_RCR4_FSE_MASK)

#define SAI_RCR4_MF_MASK                         (0x10U)
#define SAI_RCR4_MF_SHIFT                        (4U)
#define SAI_RCR4_MF_WIDTH                        (1U)
#define SAI_RCR4_MF(x)                           (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_MF_SHIFT)) & SAI_RCR4_MF_MASK)

#define SAI_RCR4_SYWD_MASK                       (0x1F00U)
#define SAI_RCR4_SYWD_SHIFT                      (8U)
#define SAI_RCR4_SYWD_WIDTH                      (5U)
#define SAI_RCR4_SYWD(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_SYWD_SHIFT)) & SAI_RCR4_SYWD_MASK)

#define SAI_RCR4_FRSZ_MASK                       (0xF0000U)
#define SAI_RCR4_FRSZ_SHIFT                      (16U)
#define SAI_RCR4_FRSZ_WIDTH                      (4U)
#define SAI_RCR4_FRSZ(x)                         (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FRSZ_SHIFT)) & SAI_RCR4_FRSZ_MASK)

#define SAI_RCR4_FPACK_MASK                      (0x3000000U)
#define SAI_RCR4_FPACK_SHIFT                     (24U)
#define SAI_RCR4_FPACK_WIDTH                     (2U)
#define SAI_RCR4_FPACK(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FPACK_SHIFT)) & SAI_RCR4_FPACK_MASK)

#define SAI_RCR4_FCOMB_MASK                      (0xC000000U)
#define SAI_RCR4_FCOMB_SHIFT                     (26U)
#define SAI_RCR4_FCOMB_WIDTH                     (2U)
#define SAI_RCR4_FCOMB(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCOMB_SHIFT)) & SAI_RCR4_FCOMB_MASK)

#define SAI_RCR4_FCONT_MASK                      (0x10000000U)
#define SAI_RCR4_FCONT_SHIFT                     (28U)
#define SAI_RCR4_FCONT_WIDTH                     (1U)
#define SAI_RCR4_FCONT(x)                        (((uint32_t)(((uint32_t)(x)) << SAI_RCR4_FCONT_SHIFT)) & SAI_RCR4_FCONT_MASK)
/*! @} */

/*! @name RCR5 - Receive Configuration 5 */
/*! @{ */

